Repository: FPGAwars/iceMux
Catalog: locale/*/*.po
Languages: es_es

source: DeMux-1-4
es_es: DeMux-1-2-Bus

source: 1-to-2 DeMultplexer (1-bit channels) (Outputs grouped in a Bus)
es_es: Demultiplexor 1-2 (Canales de 1 bit) (Salidas agrupadas en un bus)

source: 1-to-2 DeMultplexer (1-bit channels)
es_es: Demultiplexor 1-2 (Canales de 1-bit)

source: Two bits input And gate
es_es: Puerta AND con entrada de dos bits

source: NOT gate (Verilog implementation)
es_es: Puerta NOT (Implementacion en verilog)

source: Bus2-Join-all: Joint two wires into a 2-bits Bus
es_es: Bus2-Join-all: Juntar dos cables en un bus de 2-bits

source: Input
es_es: Entrada

source: Output
es_es: Salida

source: DeMux-1-2-verilog
es_es: DeMux-1-2-Bus

source: 1-to-2 DeMultplexer (1-bit channels) (Verilog implementation)
es_es: Demultiplexor 1-2 (Canales de 1 bit) (Implementación en verilog)

source: 1-to-2 DeMultiplexer (1-bit channels) (Flipped version)
es_es: Demultiplexor-1-2 (Canales de 1 bit) (Versión invertida)

source: 1-to-4 DeMultplexer (1-bit channels) (Output grouped in a bus)
es_es: Demultiplexor-1-4 (Canales de 1 bit) (Salidas agrupadas en un bus)

source: 1-to-4 DeMultplexer (1-bit channels)
es_es: Demultiplexor-1-4 (Canales de 1 bit)

source: Bus2-Split-all: Split the 2-bits bus into two wires
es_es: Bus2-Split-all: Dividir el bus de 2-bits en dos cables

source: Bus4-Join-all: Join all the wires into a 4-bits Bus
es_es: Bus4-Join-all: Juntar todos los cables en un bus de 4-bits

source: 1-to-4 DeMultplexer (1-bit channels) Verilog implementation
es_es: Demultiplexor-1-4 (Canales de 1 bit). Implementación en Verilog

source: 1-to-4 DeMultplexer (1-bit channels). Flipped version
es_es: Demultiplexor-1-4 (Canales de 1-bit). Versión invertida

source: 1-to-8 DeMultplexer (1-bit channels) (Output grouped in a bus)
es_es: Demultiplexor 1-8 (Canales de 1-bit) (Salidas agrupadas en un bus)

source: Bus8-Join-all: Join all the wires into a 8-bits Bus
es_es: Bus8-Join-all: Juntar los dos cables en uno de 8 bits

source: 1-to-8 DeMultplexer (1-bit channels)
es_es: Demultiplexor 1-8 (Canales de 1 bit)

source: Bus3-Split-all: Split the 3-bits bus into three wires
es_es: Bus3-Split-all: Dividir el bus de 3-bits bus en tres cables

source: 1-to-8 DeMultplexer (1-bit channels) Verilog implementation
es_es: Demultiplexor 1-8 (Canales de 1 bit). Implementación en verilog

source: 1-to-8 DeMultplexer (1-bit channels). Flipped version
es_es: Demultiplexor 1-8 (Canales de 1-bit). Versión invertida

source: DeMux-1-2-02-bits: 1-to-2 DeMultplexer (2-bit channels)
es_es: DeMux-1-2-02-bits: De multiplexor de 1 a 2 (Canales de 2 bits)

source: DeMux-1-4-02-bits: 1-to-2 DeMultplexer (2-bit channels)
es_es: DeMux-1-4-02-bits: Demultiplexor de 1 a 2 (Canales de 2 bits)

source: DeMux-1-2-03-bits: 1-to-2 DeMultplexer (3-bit channels)
es_es: DeMux-1-2-03-bits: De multiplexor de 1 a 2 (Canales de 3 bits)

source: Bus3-Join-all: Joint three wires into a 3-bits Bus
es_es: Bus3-Join-all: Juntar los tres cables en uno de 3 bits

source: DeMux-1-4-03-bits: 1-to-2 DeMultplexer (3-bit channels)
es_es: DeMux-1-4-03-bits: Demultiplexor de 1 a 2 (Canales de 3 bits)

source: 1-to-8 DeMultplexer (3-bit channels)
es_es: Demultiplexor 1-8 (Canales de 3 bits)

source: DeMux-1-2-04-bits: 1-to-2 DeMultplexer (4-bit channels)
es_es: DeMux-1-2-04-bits: De multiplexor de 1 a 2 (Canales de 4 bits)

source: Bus4-Split-all: Split the 4-bits bus into its wires
es_es: Bus4-Split-all: Dividir el bus de 4-bits en sus cables

source: DeMux-1-4-04-bits: 1-to-2 DeMultplexer (4-bit channels)
es_es: DeMux-1-4-04-bits: Demultiplexor de 1 a 2 (Canales de 4 bits)

source: 1-to-8 DeMultplexer (4-bit channels)
es_es: Demultiplexor 1-8 (Canales de 4 bits)

source: DeMux-1-2-08-bits: 1-to-2 DeMultplexer (8-bit channels)
es_es: DeMux-1-2-08-bits: De multiplexor de 1 a 2 (Canales de 8 bits)

source: Bus8-Join-half: Join the two same halves into an 8-bits Bus
es_es: Bus8-Join-half: Juntar los dos buses en uno de 8 bits

source: Bus8-Split-half: Split the 8-bits bus into two buses of the same size
es_es: Bus8-Split-half: Dividir el bus de 8-bits bus en dos buses del mismo tamaño

source: DeMux-1-4-08-bits: 1-to-4 DeMultplexer (8-bit channels)
es_es: DeMux-1-4-08-bits: Demultiplexor de 1 a 4 (Canales de 8 bits)

source: 1-to-8 DeMultplexer (8-bit channels)
es_es: Demultiplexor 1-8 (Canales de 8 bits)

source: 19-bits
es_es: 16-bits

source: Mux-2-1-Bus-verilog: 2-to-1 Multplexer (1-bit channels). Inputs grouped into a Bus. Verilog implementation
es_es: Mux-2-1-Bus-verilog: Multiplexor 2-1 (Canales de 1 bit): Entradas agrupadas en un bus. Implementación en verilog

source: 2-to-1 Multplexer (1-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 1 bit). Implementación en verilog

source: MuxF-2-1-verilog: 2-to-1 Multplexer (1-bit channels). Fippled version
es_es: MuxF-2-1-verilog: Multiplexor 2-1 (Canales de 1 bit). Versión invertida

source: 2-to-1 Multplexer (1-bit channels). Inputs grouped into a Bus
es_es: Multiplexor 2-1 (Canales de 1 bit): Entradas agrupadas en un bus

source: 2-to-1 Multplexer (1-bit channels)
es_es: Multiplexor 2-1 (Canales de 1-bit)

source: OR2: Two bits input OR gate
es_es: OR2: Puerta OR de dos bits

source: 2-to-1 Multplexer (1-bit channels). Fippled version
es_es: Multiplexor 2-1 (Canales de 1 bit). Versión invertida

source: 4-to-1 Multplexer (1-bit channels). Verilog implementation
es_es: Multiplexer4-1 (Canales de 1 bit). Implementación en Verilog

source: 4-to-1 Multplexer (1-bit channels). Inputs grouped into a Bus
es_es: Multiplexor 4-1 (Canales de 1 bit). Entradas agrupadas en un bus

source: 4-to-1 Multplexer (1-bit channels)
es_es: Multiplexor 4-1 (Canales de 1 bit)

source: 4-to-1 Multplexer (1-bit channels). Flipped version
es_es: Multiplexor 4-1 (Canales de 1-bit). Versión invertida

source: 8-to-1 Multplexer (1-bit channels) (Verilog implementation)
es_es: Multiplexor 8-1 (Canales de 1 bit). Implementación en verilog

source: 8-to-1 Multplexer (1-bit channels). Inputs grouped into a Bus
es_es: Multiplexor 8-1 (Canales de 1 bit). Entradas agrupadas en un bus

source: Bus8-Split-all: Split the 8-bits bus into its wires
es_es: Bus8-Split-all: Dividir el bus de 8-bits en sus cables

source: 8-to-1 Multplexer (1-bit channels)
es_es: Multiplexor 8-1 (Canales de 1 bit)

source: Bus3-Split-2-1: Split the 3-bits bus into two: 2-bit and 1-bits buses
es_es: Bus3-Split-2-1: Dividir el bus de 3-bits bus en dos: buses de 2 bits y 1 bit

source: 8-to-1 Multplexer (1-bit channels). Flipped version
es_es: Multiplexor 8-1 (Canales de 1 bit). Versión invertida

source: 2-to-1 Multplexer (2-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 1 bit). Implementación en verilog

source: 2-to-1 Multplexer (2-bit channels)
es_es: Multiplexor 2-1 (canales de 2 bits)

source: Channel A
es_es: Canal A

source: Channel B
es_es: Canal B

source: 4-to-1 Multplexer (2-bit channels). Verilog implementation
es_es: Multiplexor 4-1 (Canales de 1 bit). Implementación en verilog

source: 4-to-1 Multplexer (2-bit channels)
es_es: Multiplexer 4-1 (Canales de 2 bits)

source: Channel D
es_es: Canal D

source: Channel C
es_es: Canal C

source: 8-to-1 Multplexer (2-bit channels) (Verilog implementation)
es_es: Multiplexor 8-1 (Canales de 2 bit). Implementación en verilog

source: 8-to-1 Multplexer (2-bit channels)
es_es: Multiplexor 8-1 (Canales de 2 bit)

source: 2-to-1 Multplexer (3-bit channels). Verilog implementation
es_es: Multiplexor 3-1 (Canales de 3 bit). Implementación en verilog

source: 2-to-1 Multplexer (3-bit channels)
es_es: Multiplexor 2-1 (canales de 3 bits)

source: 4-to-1 Multplexer (3-bit channels). Verilog implementation
es_es: Multiplexor 4-1 (Canales de 3 bit). Implementación en verilog

source: 4-to-1 Multplexer (3-bit channels)
es_es: Multiplexer 4-1 (Canales de 3 bits)

source: 2-to-1 Multplexer (4-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 4 bit). Implementación en verilog

source: 2-to-1 Multplexer (4-bit channels)
es_es: Multiplexor 2-1 (canales de 4 bits)

source: 4-to-1 Multplexer (4-bit channels). Verilog implementation
es_es: Multiplexor 4-1 (Canales de 4 bit). Implementación en verilog

source: 4-to-1 Multplexer (4-bit channels)
es_es: Multiplexer 4-1 (Canales de 4 bits)

source: 8-to-1 Multplexer (4-bit channels) (Verilog implementation)
es_es: Multiplexor 8-1 (Canales de 4 bit). Implementación en verilog

source: 8-to-1 Multplexer (4-bit channels)
es_es: Multiplexor 8-1 (Canales de 4 bit)

source: Bus4-Join-half: Join the two buses into a 4-bits Bus
es_es: Bus4-Join-half: Juntar los dos buses en uno de 4 bits

source: Bus4-Split-half: Split the 4-bits bus into two of the same size
es_es: Bus4-Split-half: Dividir el bus de 4-bits en dos buses del mismo tamaño

source: 2-to-1 Multplexer (5-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 5 bit). Implementación en verilog

source: Bus5-Split-1-4: Split the 5-bits bus into two buses of 1 and 4 bits
es_es: Bus5-Split-1-4: Dividir el bus de 5-bits bus en dos buses de 1 y 4 bits

source: Bus5-Join-1-4: Join the two buses of 1 and 4 bits into a 5-bits Bus
es_es: Bus5-Join-1-4: Juntar los dos buses de 1 y 4 bits en uno de 5bits

source: 2-to-1 Multplexer (6-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 6 bit). Implementación en verilog

source: 2-to-1 Multplexer (6-bit channels)
es_es: Multiplexor 2-1 (canales de 6 bits)

source: Bus6-Split-2-4: Split the 6-bits bus into two buses of 2 and 4 wires
es_es: Bus6-Split-2-4: Dividir el bus de 6-bits en dos buses de 2 y 4 cables

source: Bus6-Join-2-4: Join all the two buses into a 6-bits Bus
es_es: Bus6-Join-2-4: Juntar los dos buses en uno de 6 bits

source: 2-to-1 Multplexer (7-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 7 bit). Implementación en verilog

source: 2-to-1 Multplexer (7-bit channels)
es_es: Multiplexor 2-1 (canales de 7 bits)

source: Bus7-Join-3-4: Join the two buses into a 7-bits Bus
es_es: Bus7-Join-3-4: Juntar los dos buses en uno de 7 bits

source: Bus7-Split-3-4: Split the 7-bits bus into two buses of 3 and 4 wires
es_es: Bus7-Split-3-4: Dividir el bus de 7-bits en dos buses de 3 y 4 cables

source: 2-to-1 Multplexer (8-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 8 bit). Implementación en verilog

source: 4-to-1 Multplexer (8-bit channels). Verilog implementation
es_es: Multiplexor 4-1 (Canales de 8 bit). Implementación en verilog

source: 4-to-1 Multplexer (8-bit channels)
es_es: Multiplexer 4-1 (Canales de 8 bits)

source: 8-to-1 Multplexer (8-bit channels) (Verilog implementation)
es_es: Multiplexor 8-1 (Canales de 8 bit). Implementación en verilog

source: 8-to-1 Multplexer (8-bit channels)
es_es: Multiplexor 8-1 (Canales de 8 bit)

source: Bus8-Join-quarter: Join the four quarters into an 8-bits Bus
es_es: Bus8-Join-quarter: Juntar los cuatro cuartos en bus de 8 bits

source: Bus8-Split-quarter: Split the 8-bits bus into four buses of the same size
es_es: Bus8-Split-quarter: Dividir el bus de 8-bits en cuatro buses del mismo tamaño

source: 2-to-1 Multplexer (9-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 9 bit). Implementación en verilog

source: 2-to-1 Multplexer (9-bit channels)
es_es: Multiplexor 2-1 (canales de 9 bits)

source: Bus9-Split-half: Split the 9-bits bus into two buses of 1 and 8 wires
es_es: Bus9-Split-half: Dividir el bus de 9-bits en dos buses de 1 y 8 cables

source: Bus8-Join-1-8: Join the two buses into an 9-bits Bus
es_es: Bus8-Join-1-8: Juntar los dos buses en uno de 9 bits

source: 2-to-1 Multplexer (10-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 10 bit). Implementación en verilog

source: 2-to-1 Multplexer (10-bit channels)
es_es: Multiplexor 2-1 (canales de 10 bits)

source: Bus10-Split-2-8: Split the 10-bits bus into two buses of 2 and 8 wires
es_es: Bus10-Split-2-8: Dividir el bus de 10-bits bus en dos buses de 2 y 8 cables

source: Bus10-Join-2-8: Join the two buses into an 10-bits Bus
es_es: Bus10-Join-2-8: Juntar los dos buses en uno de 10 bits

source: 2-to-1 Multplexer (11-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 11 bit). Implementación en verilog

source: 2-to-1 Multplexer (11-bit channels)
es_es: Multiplexor 2-1 (canales de 11 bits)

source: Bus11-Split-3-8: Split the 11-bits bus into two buses of 3 and 8 wires
es_es: Bus11-Split-3-8: Dividir el bus de 11-bits bus en dos buses de 3 y 8 cables

source: Bus11-Join-3-8: Join the two buses into an 11-bits Bus
es_es: Bus11-Join-3-8: Juntar los dos buses en uno de 11 bits

source: 2-to-1 Multplexer (12-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 12 bit). Implementación en verilog

source: 2-to-1 Multplexer (12-bit channels)
es_es: Multiplexor 2-1 (canales de 12 bits)

source: Bus12-Split-4-8: Split the 12-bits bus into two buses of 4 and 8 wires
es_es: Bus12-Split-4-8: Dividir el bus de 12-bits bus en dos buses de 4 y 8 cables

source: Bus12-Join-4-8: Join the two buses into an 12-bits Bus
es_es: Bus12-Join-4-8: Juntar los dos buses en uno de 12 bits

source: Bocks
es_es: Blocks

source: 2-to-1 Multplexer (15-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 15 bit). Implementación en verilog

source: 2-to-1 Multplexer (15-bit channels)
es_es: Multiplexor 2-1 (canales de 15 bits)

source: Bus15-Split-7-8: Split the 15-bits bus into two buses of 7 and 8 bits
es_es: Bus15-Split-7-8: Dividir el bus de 15-bits bus en dos buses de 7 y 8 cables

source: Bus15-Join-7-8: Join the two buses into a 15-bits Bus
es_es: Bus15-Join-7-8: Juntar los dos buses en uno de 15 bits

source: 2-to-1 Multplexer (16-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 16 bit). Implementación en verilog

source: 2-to-1 Multplexer (16-bit channels)
es_es: Multiplexor 2-1 (canales de 16 bits)

source: Bus16-Split-half: Split the 16-bits bus into two buses of the same size
es_es: Bus16-Split-half: Dividir el bus de 16-bits bus en dos buses del mismo tamaño

source: Bus16-Join-half: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-half: Juntar los dos buses iguales en uno de 16 bits

source: 2-to-1 Multplexer (19-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 19 bit). Implementación en verilog

source: 2-to-1 Multplexer (19-bit channels)
es_es: Multiplexor 2-1 (canales de 1 bits)

source: Bus19-Split-3-8-8: Split the 19-bits bus into three buses of 3, 8 and 8 wires
es_es: Bus19-Split-3-8-8: Dividir el bus de 19-bits bus en tres buses de 3,8 y 8 cables

source: Bus19-Join-3-8-8: Join the three buses into a 19-bits Bus
es_es: Bus19-Join-3-8-8: Juntar los tres buses en uno de 19 bits

source: 2-to-1 Multplexer (20-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 20 bit). Implementación en verilog

source: 2-to-1 Multplexer (20-bit channels)
es_es: Multiplexor 2-1 (canales de 20 bits)

source: Bus20-Split-4-8-8: Split the 20-bits bus into three buses of 4, 8 and 8 wires
es_es: Bus20-Split-4-8-8: Dividir el bus de 20-bits en tres buses de 4, 8 y 8 cables

source: Bus20-Join-4-8-8: Join the three buses into an 20-bits Bus
es_es: Bus20-Join-4-8-8: Juntar los tres buses en uno de 20 bits

source: 2-to-1 Multplexer (23-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 23 bit). Implementación en verilog

source: 2-to-1 Multplexer (23-bit channels)
es_es: Multiplexor 2-1 (canales de 23 bits)

source: Bus19-Split-3-8-8: Split the 19-bits bus into three buses of 3,8 and 8 bits
es_es: Bus19-Split-3-8-8: Dividir el bus de 19-bits bus en dos buses de 3,8 y 8 bits

source: Bus23-Join-7-8-8: Join the three buses into a 23-bits Bus
es_es: Bus23-Join-7-8-8: Juntar los tres buses en uno de 23 bits

source: 2-to-1 Multplexer (24-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 24 bit). Implementación en verilog

source: 2-to-1 Multplexer (24-bit channels)
es_es: Multiplexor 2-1 (canales de 24 bits)

source: Bus24-Split-one-third: Split the 24-bits bus into three buses of the same size
es_es: Bus24-Split-one-third: Dividir el bus de 24-bits en tres buses del mismo tamaño

source: Bus24-Join-one-third: Join the three buses into an 24-bits Bus
es_es: Bus24-Join-one-third: Juntar los tres buses en uno de 24 bits

source: 2-to-1 Multplexer (27-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 27 bit). Implementación en verilog

source: 2-to-1 Multplexer (27-bit channels)
es_es: Multiplexor 2-1 (canales de 27 bits)

source: Bus27-Split-3-8-8-8: Split the 27-bits bus into four buses of 7,8, 8 and 8 bits
es_es: Bus27-Split-3-8-8-8: Dividir el bus de 27-bits en cuatro buses de 7, 8, 8 y 8 bits

source: Bus27-Join-3-8-8-8: Join the four buses into a 27-bits Bus
es_es: Bus27-Join-3-8-8-8: Juntar los cuatro buses en uno de 27 bits

source: 2-to-1 Multplexer (28-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 28 bit). Implementación en verilog

source: 2-to-1 Multplexer (28-bit channels)
es_es: Multiplexor 2-1 (canales de 28 bits)

source: Bus28-Split-4-8-8-8: Split the 28-bits bus into four buses of 4, 8, 8, and 8 wires
es_es: Bus28-Split-4-8-8-8: Dividir el bus de 28-bits en cuatro buses de 4, 8, 8 y 8 cables

source: Bus28-Join-4-8-8-8: Join the four buses into an 28-bits Bus
es_es: Bus28-Join-4-8-8-8: Juntar los cuatro buses en uno de 28 bits

source: 2-to-1 Multplexer (31-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 31 bit). Implementación en verilog

source: 2-to-1 Multplexer (31-bit channels)
es_es: Multiplexor 2-1 (canales de 31 bits)

source: Bus31-Split-7-8-8-8: Split the 31-bits bus into four buses of 7,8, 8 and 8 bits
es_es: Bus31-Split-7-8-8-8: Dividir el bus de 31-bits en cuatro buses de 7, 8, 8 y 8 bits

source: Bus31-Join-7-8-8-8: Join the four buses into a 31-bits Bus
es_es: Bus31-Join-7-8-8-8: Juntar los cuatro buses en uno de 31 bits

source: 2-to-1 Multplexer (32-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 32 bit). Implementación en verilog

source: 2-to-1 Multplexer (32-bit channels)
es_es: Multiplexor 2-1 (canales de 32 bits)

source: Bus32-Join-quarter: Join the four buses into an 32-bits Bus
es_es: Bus32-Join-quarter: Juntar los cuatro buses en uno de 32 bits

source: Bus32-Split-quarter: Split the 32-bits bus into four buses of 8 wires
es_es: Bus32-Split-quarter: Dividir el bus de 32-bits bus en cuatro buses de 8 cables

source: # INDEX: IceMux Collection
es_es: # ÍNDICE: Colección IceMux

source: Constant bit 1
es_es: Bit 1 constante

source: System TFF: It toogles its output on every system cycle
es_es: Biestable T del sistema: Cambia su salida en cada ciclo de reloj del sistema

source: D Flip-flop (verilog implementation)
es_es: Biestable D (Implementación en verilog)

source: ## Example: Manual testing of the 2-to-1 Mux The LED is on (at its maximum bright) when the button is not pressed. When the button is pressed a 50 percent duty cycle signal is sent to the LED. The LED is on but less bright
es_es: ## Ejemplo: Prueba manual del Mux-2-1 El LED se enciende (a su maxáximo brillo) cuando el botón no se aprieta. Cuando el botón se aprieta, una señal con ciclo de trabajo del 50 se envía al LED. El LED se enciende pero con menos brillo

source: T-Flip flop
es_es: Biestable T

source: 50 percent duty cycle
es_es: Ciclo de trabajo del 50 por ciento

source: Channel 1
es_es: Canal 1

source: Channel 0
es_es: Canal 0

source: button for selecting the channel to send to the LED
es_es: botón para seleccionar el canal a enviar al LED

source: **2-to-1 Mux**
es_es: **Mux-2-1**

source: Parameter: Initial value
es_es: Parámetro: Valor inicial

source: System clock
es_es: Reloj del sistema

source: Input data
es_es: Datos de entrada

source: # D Flip-Flop It stores the input data that arrives at cycle n Its output is shown in the cycle n+1
es_es: # Biestable D Almacena el dato de entrada que llega en el ciclo n Su salida se muestra en el ciclo n+1

source: Constant bit 0
es_es: Bit 0 constante

source: 2bits constant value: 3
es_es: Valor constante de 2 bits: 3

source: Generic: 2-bits generic constant (0,1,2,3)
es_es: Generic: Constante genérica de 2-bits

source: ## Example: Manual testing of the 2-to-1 Mux The Green LED is on (at its maximum bright) when the button is not pressed. When the button is pressed a 50 percent duty cycle signal is sent to the LED. The green LED is on but less bright
es_es: ## Ejemplo: Prueba manual del Mux-2-1 El LED verde se enciende (a su máximo brillo) cuando el botón no se aprieta. Cuando el botón se aprieta, una señal con ciclo de trabajo del 50 se envía al LED. El LED verde se enciende pero con menos brillo

source: Switch for selecting the channel to send to the LED
es_es: Interruptor para seleccionar el canal a enviar al LED

source: ## RGB LED
es_es: ## LED RGB

source: Red and blue disabled
es_es: Rojo y azul deshabilitados

source: Negative logic
es_es: Lógica negativa

source: Positive logic: * ON: 1 * OFF: 0
es_es: Lógica positiva: * ON: 1 * OFF: 0

source: Generic: 4-bits generic constant (0-15)
es_es: Generic: Constante genérica de 4-bits (0-15)

source: ## Example: Manual testing of the 4-bits 2-to-1 Mux The button selects with number is displayed on the LEDs. Channel 0 contains the 4-bit number `1010` and the channel 1 has `0101`
es_es: ## Ejemplo: Prueba manual del Mux-2-1 de 4 bits El botón selecciona qué número se muestra en los LEDS. El canal 0 contiene el número de 4 bits `1010`y el canal 1 tiene `0101`

source: button for selecting the channel to send to the LEDs
es_es: botón para seleccionar el canal a enviar a los LEDs

source: **4-bits 2-to-1 Mux**
es_es: **Mux-2-1 de 4 bits**

source: Bus4-Split-1-3: Split the 4-bits bus into two: 1-bit and 3-bits buses
es_es: Bus4-Split-1-3: Dividir el bus de 4-bits bus en dos: buses de 1 bit y 3 bits

source: not-x3: 3-bits not gate
es_es: not-x3: Puerta not de 3 bits

source: ## Example: Manual testing of the 4-bits 2-to-1 Mux The switch selects which number is displayed on the RGB LED. Channel 0 contains the 4-bit number `1010` and the channel 1 has `0101`. The most significant bit is displayed on a external LED
es_es: ## Ejemplo: Prueba manual del Mux-2-1 de 4 bits El interruptor selecciona qué número se muestra en el LED RGB. El canal 0 contiene el número de 4 bits `1010`y el canal 1 tiene `0101`. El bit más significativo se muestra en un LED externo

source: switch for selecting the channel to send to the RGB LED
es_es: interruptor para seleccionar el canal a enviar al LED RGB

source: External LED
es_es: LED externo

source: Button-tic: Configurable button that emits a tic when it is pressed
es_es: Button-tic: Botón configurable que emite un tic cuando se aprieta

source: Rising-edge detector. It generates a 1-period pulse (tic) when a rising edge is detected on the input
es_es: Detector de flanco de subida. Se genera un tic cuando se detecta un flanco de subida en la entrada

source: Configurable button (pull-up on/off. Not on/off)
es_es: Botón configurable (pull-up on/off. Not on/off)

source: FPGA internal pull-up configuration on the input port
es_es: Configuración del Pull-up interno de la FPGA en el puerto de entrada

source: Remove the rebound on a mechanical switch
es_es: Eliminar el rebote en un interruptor mecánico

source: 1bit register (implemented in verilog)
es_es: Registro de 1 bit (Implementado en verilog)

source: 16-bits Syscounter with reset
es_es: Contador del sistema de 16-bits con reset

source: DFF-rst-x16: 16 D flip-flops in paralell with reset
es_es: DFF-rst-x16: 16 Biestables D en paralelo con reset

source: DFF-rst-x04: Three D flip-flops in paralell with reset
es_es: DFF-rst-x04: Tres Biestable D en paralelo con reset
