Repository: FPGAwars/iceMux
Catalog: locale/*/*.po
Languages: es_es

source: Display32-8: Display a 32-bits value on an 8-LEDs. The sel input selects the byte to display
es_es: Display32-8: Mostrar un valor de 32-bits en 8 LEDs. La entrada sel selecciona el byte a mostrar

source: Bus32-Join-half: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-half: Juntar los dos buses en uno de 32-bits

source: Display64-8: Display a 64-bits value on 8-LEDs. The sel input selects the byte to display
es_es: Display64-8: Mostrar un valor de 64-bits en 8 LEDs. La entrada sel selecciona el byte a mostrar

source: Bus64-Split-half: Split the 64-bits bus into two buses of 32 wires
es_es: Bus64-Split-half: Dividir el bus de 64-bits bus en dos buses de 32 cables

source: Bus64-Join-half: Join the two buses into an 64-bits Bus
es_es: Bus64-Join-half: Juntar los dos buses en uno de 64 bits

source: 2bits constant value: 1
es_es: Valor constante de 2 bits: 1

source: 2bits constant value: 2
es_es: Valor constante de 2 bits: 2

source: ## Manual testing One constant is shown on the leds. When the button is pressed, the other constants is diplayed on the LEDs
es_es: ## Prueba manual Una constante se muestra en los LEDs. Cuando el botón se aprieta, la otra constante se muestra en los LEDs

source: ## Manual testing The four numbers are displayed on the LEDs according to the value of the input buttons
es_es: ## Prueba manual Los 4 números se meustra en los LEDs según el valor de los botones de entrada

source: 3bits constant value: 1
es_es: Valor constante de 3 bits: 1

source: 3bits constant value: 2
es_es: Valor constante de 3 bits: 2

source: 3bits constant value: 4
es_es: Valor constante de 3 bits: 4

source: Generic: 7-bits generic constant (0-127)
es_es: Generic: Constante genérica de 7-bits (0-127)

source: ## 8-bits Mux-2-1: Manual testing Two 8-bit values are displayed on the leds, depending on the sw1 button
es_es: ## Mux 2-1 de 8 bits: Prueba manual Dos valores de 8 bits se muestran en los LEDs, dependiendo del pulsador SW1

source: ## 8-bits Mux-4-1: Manual testing Two 8-bit values are displayed on the leds, depending on the sw1 button
es_es: ## Mux 4-1 de 8 bits: Prueba manual Dos valores de 8 bits se muestran en los LEDs, dependiendo del pulsador SW1

source: UINT8-1bit: Extend a 1-bit unsigned integer to 8-bits
es_es: UINT8-1bits: Extender un entero sin signo de 1 a 8 bits

source: Bus7-Join-7-1: Join the two buses into an 8-bits Bus
es_es: Bus7-Join-7-1: Juntar los dos buses en uno de 8 bits

source: 7bits constant value: 0
es_es: Valor constante de 7-bit: 0

source: Generic: 9-bits generic constant
es_es: Generic: Constante genérica de 9-bits

source: ## 9-bits Mux-2-1: Manual testing
es_es: ## Mux 2-1 de 9 bits: Prueba manual

source: UINT8-2bits: Extend a 2-bits unsigned integer to 8-bits
es_es: UINT8-2bits: Extender un entero sin signo de 2 a 8 bits

source: Bus8-Join-6-2: Join the two buses into an 8-bits Bus
es_es: Bus8-Join-6-2: Juntar los dos buses en uno de 8 bits

source: 6bits constant value: 0
es_es: Valor constante de 6-bit: 0

source: ## 10-bits Mux-2-1: Manual testing
es_es: ## Mux-2-1 de 10 bits: Prueba manual

source: Generic: 11-bits generic constant
es_es: Generic: Constante genérica de 11-bits

source: UINT8-3bits: Extend a 3-bits unsigned integer to 8-bits
es_es: UINT8-3bits: Extender un entero sin signo de 3 a 8 bits

source: Bus8-Join-5-3: Join the two buses into an 8-bits Bus
es_es: Bus8-Join-5-3: Juntar los dos buses en uno de 8 bits

source: 5bits constant value: 0
es_es: Valor constante de 5 bits: 0

source: ## 11-bits Mux-2-1: Manual testing
es_es: ## Mux 2-1 de 11 bits: Prueba manual

source: Generic: 12-bits generic constant (0-4095)
es_es: Generic: Constante genérica de 12-bits (0-4095)

source: UINT8-4bits: Extend a 4-bits unsigned integer to 8-bits
es_es: UINT8-4bits: Extender un entero sin signo de 4 a 8 bits

source: ## 12-bits Mux-2-1: Manual testing
es_es: ## Mux 2-1 de 12 bits: Prueba manual

source: Generic: 15-bits generic constant
es_es: Generic: Constante genérica de 15-bits

source: UINT8-7bits: Extend a 7-bits unsigned integer to 8-bits
es_es: UINT8-7bits: Extender un entero sin signo de 7 a 8 bits

source: Bus7-Join-1-7: Join the two buses into an 8-bits Bus
es_es: Bus7-Join-1-7: Juntar los dos buses en uno de 8 bits

source: ## 15-bits Mux-2-1: Manual testing
es_es: ## Mux 2-1 de 15 bits: Prueba manual

source: ## 16-bits Mux-2-1: Manual testing
es_es: ## Mux 2-1 de 16 bits: Prueba manual

source: Generic: 19-bits generic constant
es_es: Generic: Constante genérica de 19-bits

source: ## 19-bits Mux-2-1: Manual testing
es_es: ## Mux 2-1 de 19 bits: Prueba manual

source: Generic: 20-bits generic constant
es_es: Generic: Constante genérica de 20-bits

source: ## 20-bits Mux-2-1: Manual testing
es_es: ## Mux 2-1 de 20 bits: Prueba manual

source: Generic: 23-bits generic constant
es_es: Generic: Constante genérica de 23-bits

source: ## 23-bits Mux-2-1: Manual testing
es_es: ## Mux 2-1 de 23 bits: Prueba manual

source: Generic: 24-bits generic constant
es_es: Generic: Constante genérica de 24-bits

source: ## 24-bits Mux-2-1: Manual testing
es_es: ## Mux 2-1 de 24 bits: Prueba manual

source: Generic: 27-bits generic constant
es_es: Generic: Constante genérica de 27-bits

source: ## 27-bits Mux-2-1: Manual testing
es_es: ## Mux 2-1 de 27 bits: Prueba manual

source: Generic: 28-bits generic constant
es_es: Generic: Constante genérica de 28-bits

source: ## 28-bits Mux-2-1: Manual testing
es_es: ## Mux 2-1 de 28 bits: Prueba manual

source: Generic: 31-bits generic constant
es_es: Generic: Constante genérica de 31-bits

source: ## 31-bits Mux-2-1: Manual testing
es_es: ## Mux 2-1 de 31 bits: Prueba manual

source: Generic: 32-bits generic constant
es_es: Generic: Constante genérica de 32-bits

source: ## 32-bits Mux-2-1: Manual testing
es_es: ## Mux 2-1 de 32 bits: Prueba manual
