Repository: FPGAwars/iceMux
Catalog: locale/*/*.po
Languages: es_es

source: DFF-rst-x01: D Flip flop with reset input. When rst=1, the DFF is 0
es_es: DFF-rst-x01: Biestable D con entrada de reset. Cuando rst=1, el biestable es 0

source: Bus16-Split-quarter: Split the 16-bits bus into four buses of the same size
es_es: Bus16-Split-quarter: Dividir el bus de 16-bits bus en cuatro buses del mismo tamaño

source: Bus16-Join-quarter: Join the four same buses into an 16-bits Bus
es_es: Bus16-Join-quarter: Juntar los cuatro buses iguales en uno de 16 bits

source: Inc1-16bit: Increment a 16-bits number by one
es_es: Inc1-16bit: Incrementar un número de 16 bits en uno

source: AdderK-16bit: Adder of 16-bit operand and 16-bit constant
es_es: AdderK-16bit: Sumador de un operando de 16 bits y una constante de 16 bits

source: Generic: 16-bits generic constant
es_es: Generic: Constante genérica de 16-bits

source: Adder-16bits: Adder of two operands of 16 bits
es_es: Adder-16bits: Sumador de dos operandos de 16 bits

source: Adder-8bits: Adder of two operands of 8 bits
es_es: Adder-8bits: Sumador de dos operandos de 8 bits

source: Adder-4bits: Adder of two operands of 4 bits
es_es: Adder-4bits: Sumador de dos operandos de 4 bits

source: Adder-1bit: Adder of two operands of 1 bit
es_es: Adder-1bit: Sumador de dos operandos de 1 bit

source: AdderC-1bit: Adder of two operands of 1 bit plus the carry in
es_es: AdderC-1bits: Sumador de dos operandos de 1 bit más el acarreo de entrada

source: XOR gate: two bits input xor gate
es_es: Puerta XOR: Puerta XOR de entradas de dos bits

source: AdderC-4bits: Adder of two operands of 4 bits and Carry in
es_es: AdderC-4bits: Sumador de dos operandos de 4 bits más el acarreo de entrada

source: AdderC-8bits: Adder of two operands of 8 bits and Carry in
es_es: AdderC-8bits: Sumador de dos operandos de 8 bits y el acarreo de entrada

source: Edges detector. It generates a 1-period pulse (tic) when either a rising edge or a falling edge is detected on the input
es_es: Detector de flancos. Genera una señal de 1 ciclo (tic) cuando se detecta en la entrada bien un flanco de subida o uno de bajada

source: Sync 1-bit input with the system clock domain
es_es: Syncronizar una entrada de 1-bit con el reloj del sistema

source: Select positive or negative logic for the input (0=positive, 1=negative)
es_es: Seleccionar lógica positiva o negativa para la entrada (0=positiva, 1=negativa)

source: 1-bit generic constant (0/1)
es_es: Constante genérica de 1-bit (0/1)

source: Counter-x02: 2-bits counter
es_es: Counter-x02: Contador de 2-bits

source: Generic component with clk input
es_es: Componente genérico con entrada clk

source: Reg: 1-Bit register
es_es: Reg: Registro de 1-bit

source: Inc1-2bit: Increment a 2-bits number by one
es_es: Inc1-2bit: Incrementar un número de 2 bits en uno

source: AdderK-2bit: Adder of 2-bit operand and 2-bit constant
es_es: AdderK-2bit: Sumador de un operando de 2 bits y una constante de 2 bits

source: Adder-2bits: Adder of two operands of 2 bits
es_es: Adder-2bits: Sumador de dos operandos de 2 bits

source: sysclk_div4: Generate a signal from the division of the system clock by 4
es_es: sysclk_div4: Generar una señal a partir de la división del reloj del sistema por 4

source: 2-bits Syscounter
es_es: Contador del sistema de 2 bits

source: DFF-02: Two D flip-flops in paralell
es_es: DFF-02: Dos Biestables D en paralelo

source: sysclk_div: Generate a signal from the division of the system clock by 2
es_es: sysclk_div: Generar una señal a partir de la división entre dos del reloj del sistema

source: ## Example: Manual testing of the 4-to-1 Mux Four signal with duty cycles of 100%, 50%, 25% and 0% are selected and displayed on LED7. When the button is pressed, the next channel is selected, starting from channel 0
es_es: ## Ejemplo: Prueba manual del Mux 4-1 Cuatro señales con ciclos de trabajo del 100%, 50%, 25% y 0% se seleccionan y se muestran en el LED7. Cuando el bóton se aprieta, el siguiente canal se selecciona, comenzando por el canal 0

source: **4-to-1 Mux**
es_es: **Mux-4-1**

source: 2-bits counter
es_es: Contador de 2 bits

source: Button state signal
es_es: Señal de estado del botón

source: Tic: button pressed
es_es: Tic: Botón apretado

source: Rising edge detector
es_es: Detector de flanco de subida

source: ## Rising edge detector It generates a 1-period pulse (tic) when a rising edge is detected on the input signal
es_es: ## Detector de flanco de subida Se genera un tic cuando se detecta un flanco de subida en la señal de entrada

source: Input signal
es_es: Señal de entrada

source: Current signal state
es_es: Estado actual de la señal

source: Signal state in the previous clock cycle
es_es: Estado de la señal en el ciclo previo de reloj

source: If the current signal is 1 and its value in the previous clock cycle was 0, it means that a rising edge has been detected! The output es 1 In any other case the output is 0
es_es: Si la señal actual es 1 y su valor en el ciclo previo de reloj fue 0, significa que se ha detectado un flanco de subida! La salida es 1 In cualquier otro caso la salida es 0

source: **Delay**: 0 clock cycles There is no delay between the arrival of a rising edge and its detection
es_es: **Retardo**: 0 ciclos de reloj No hay retraso entre la llegada de un flanco de subida and su detección

source: Internal pull-up * 0: OFF * 1: ON
es_es: Pull-up interna: * 0: OFF * 1: ON

source: Synchronization stage
es_es: Etapa de sincronización

source: Normalization stage * 0: Wire * 1: signal inverted
es_es: Etapa de normalización * 0: Cable * 1: Señal invertida

source: Debouncing stage
es_es: Etapa antirrebotes

source: ### Pull-up parameter: 0: No pull-up 1: Pull-up activated
es_es: ### Parámetro Pull-up: 0: Sin pull-up 1: Pull-up activado

source: Only an FPGA pin can be connected here!!!
es_es: Sólo un pin de la FPGA se puede conectar aquí!!!

source: The pull-up is connected by default
es_es: El pull-up se conecta por defecto

source: Edge detector
es_es: Detector de flanco

source: Whenever there is a change in the input, the counter is started
es_es: En cuanto hay un cambio en la entrada, el contador arranca

source: If the counter reaches it maximum value, the input is considered stable and it is captured
es_es: Si el contador alcanza su valor máximo, la entrada se considera estable y se captura

source: ### Time calculation For CLK=12MHZ, a 16-bit counter reaches its maximum every 2 ** 16 * 1/F = 5.5ms aprox IF more time is needed for debouncing, use a counter with more bits (17, 18...)
es_es: ### Cálculo de la temporización Para CLK=12MHZ, un contador de 16-bits alcanza su máximo cada 2**16 * 1 /F = 5.5ms aprox Si se necesita más tiempo para el antirrebotes, usa un contador con más bits (17, 18...)

source: ## Debouncer A value is considered stable when there is no changes during 5.5ms aprox. When a value is stable it is captured on the output flip-flop
es_es: ## Antirrebotes Un valor se considera estable cuando no presenta cambios durante 5.5ms aprox. Cuando un valor es estable se capura en el biestable de salida

source: Stable output
es_es: Salida estable

source: Counter
es_es: Contador

source: Initial value
es_es: Valor inicial

source: Reset input: Active high When rst = 1, the DFF is reset to 0
es_es: Entrada de reset: Activa a nivel alto Cuando rst=1, El biestable se pone a 0

source: Data input
es_es: Entrada de datos

source: Initial default value: 0
es_es: Valor inicial por defecto: 0

source: ## Edges detector It generates a 1-period pulse (tic) when an edge (Rising or falling) is detected on the input signal
es_es: ## Detector de flancos Se genera un tic cuando se detecta un flanco (de subida o bajada) en la señal de entrada

source: The output is 1 if the current value is 1 and the previous 0, or if the current value is 0 and the previous 1
es_es: La salida es 1 si el valor actual es 1 y el anterior es 0, o si el actual es 0 y el previo 1

source: In any other case the output is 0
es_es: En acualquier otro caso la salida es 0

source: When k=0, it works like a wire (The output is equal to the input) When k=1, it act as a not gate (The output is the inverse of the input)
es_es: Cuando k=0, funciona como un cable (La salida es igual a la entrada) Cuando k=1, actúa como una puerta not (La salida es la inversa de la entrada)

source: ### Truth table for XOR | k | input | output | function | |---|-------|--------|----------| | 0 | 0 | 0 | wire | | 0 | 1 | 1 | wire | | 1 | 0 | 1 | Not | | 1 | 1 | 0 | Not |
es_es: ### Tabla de verdad del XOR | k | entrada | salida | función | |---|-------|--------|----------| | 0 | 0 | 0 | cable | | 0 | 1 | 1 | cable | | 1 | 0 | 1 | Not | | 1 | 1 | 0 | Not |

source: Mux 2-1
es_es: Mux

source: D Flip-flip (System)
es_es: Biestable D (Sistema)

source: Button-tic: Configurable button that emits a tic when it is pressed. ECP5 FPGA Family
es_es: Button-tic: Botón configurable que emite un tic cuando se aprieta. Familia de FPGAs ECP5

source: Configurable button (pull-up on/off. Not on/off). ECP5 FPGA family
es_es: Botón configurable (pull-up on/off. Not on/off). Familia de FPGAs ECP5

source: 4bits constant value: 0
es_es: Valor constante de 4 bits: 0

source: not-x2: 2-bits not gate
es_es: not-x2: Puerta not de 2 bits

source: ## Example: Manual testing of the 4-to-1 Mux Four signal with duty cycles of 100%, 50%, 25% and 0% are selected and displayed on the Green LED. When the button is pressed, the next channel is selected, starting from channel 0
es_es: ## Ejemplo: Prueba manual del Mux 4-1 Cuatro señales con ciclos de trabajo del 100%, 50%, 25% y 0% se seleccionan y se muestran en el LED verde. Cuando el bóton se aprieta, el siguiente canal se selecciona, comenzando por el canal 0

source: switches for selecting the channel to send to the LEDs
es_es: interruptor para seleccionar el canal a enviar a los LEDs

source: ## Example: Manual testing of the 4-bits 4-to-1 Mux The buttons selects which number is displayed on the LEDs: `0101`, `1010`, `0011`, `1100`
es_es: ## Ejemplo: Prueba manual del Mux-4-1 de 4 bits Los botones selecciona qué número se muestra en los LEDs: `0101`, `1010`, `0011`, `1100`

source: **4-bits 4-to-1 Mux**
es_es: **Mux-4-1 de 4 bits**

source: ## Example: Manual testing of the 4-bits 4-to-1 Mux The switches select which number is displayed on the RGB LED: `0101`, `1010`, `0011`, `1100`
es_es: ## Ejemplo: Prueba manual del Mux-4-1 de 4 bits Los interruptores seleccionan qué número se muestra en el LED RGB: `0101`, `1010`, `0011`, `1100`

source: Counter-x03: 3-bits counter
es_es: Counter-x03: Contador de 3-bits

source: Reg-x03: 3-bits register
es_es: Reg-x03: Registro de 3 bits

source: Inc1-3bit: Increment a 3-bits number by one
es_es: Inc1-3bit: Incrementar un número de 3 bits en uno

source: AdderK-3bit: Adder of 3-bit operand and 3-bit constant
es_es: AdderK-3bit: Sumador de un operando de 3 bits y una constante de 3 bits

source: Generic: 3-bits generic constant (0-7)
es_es: Generic: Constante genérica de 3-bits

source: Adder-3bits: Adder of two operands of 3 bits
es_es: Adder-3bits: Sumador de dos operandos de 3 bits

source: sysclk_div8: Generate a signal from the division of the system clock by 8
es_es: sysclk_div8: Generar una señal a partir de la división del reloj del sistema por 8

source: 3-bits Syscounter
es_es: Contador del sistema de 3-bits

source: DFF-03: Three D flip-flops in paralell
es_es: DFF-03: Tres Biestables D en paralelo

source: sysclk_div16: Generate a signal from the division of the system clock by 16
es_es: sysclk_div16: Generar una señal a partir de la división del reloj del sistema por 16

source: 4-bits Syscounter
es_es: Contador del sistema de 4 bits

source: DFF-04: Three D flip-flops in paralell
es_es: DFF-04: Cuatro Biestables D en paralelo

source: Inc1-4bit: Increment a 4-bits number by one
es_es: Inc1-4bit: Incrementar un número de 4 bits en uno

source: AdderK-4bit: Adder of 4-bit operand and 4-bit constant
es_es: AdderK-3bit: Sumador de un operando de 3 bits y una constante de 3 bits

source: sysclk_div32: Generate a signal from the division of the system clock by 32
es_es: sysclk_div32: Generar una señal a partir de la división del reloj del sistema por 32

source: 5-bits Syscounter
es_es: Contador del sistema de 5 bits

source: DFF-05: five D flip-flops in paralell
es_es: DFF-05: Cinco Biestables D en paralelo

source: Inc1-5bit: Increment a 5-bits number by one
es_es: Inc1-5bit: Incrementar un número de 5 bits en uno

source: AdderK-5bit: Adder of 5-bit operand and 5-bit constant
es_es: AdderK-3bit: Sumador de un operando de 3 bits y una constante de 3 bits

source: Adder-5bits: Adder of two operands of 5 bits
es_es: Adder-5bits: Sumador de dos operandos de 5 bits

source: Generic: 5-bits generic constant (0-31)
es_es: Generic: Constante genérica de 5-bits (0-31)

source: sysclk_div64: Generate a signal from the division of the system clock by 64
es_es: sysclk_div64: Generar una señal a partir de la división del reloj del sistema por 64

source: 6-bits Syscounter with reset
es_es: Contador del sistema de 6 bits con reset

source: DFF-rst-x06: Six D flip-flops in paralell with reset
es_es: DFF-rst-x06: Seis Biestables D en paralelo con reset

source: DFF-rst-x02: Two D flip-flops in paralell with reset
es_es: DFF-rst-x02: Dos Biestable D en paralelo con reset

source: Inc1-6bit: Increment a 6-bits number by one
es_es: Inc1-6bit: Incrementar un número de 6 bits en uno

source: AdderK-6bit: Adder of 6-bit operand and 6-bit constant
es_es: AdderK-3bit: Sumador de un operando de 3 bits y una constante de 3 bits

source: Adder-6bits: Adder of two operands of 6 bits
es_es: Adder-6bits: Sumador de dos operandos de 6 bits

source: Bus6-Join-1-5: Join the two buses into a 6-bits Bus
es_es: Bus6-Join-1-5: Juntar los dos buses en uno de 6 bits

source: Generic: 6-bits generic constant (0-63)
es_es: Generic: Constante genérica de 6-bits (0-63)

source: ## Example: Manual testing of the 8-to-1 Mux Eight signals with duty cycles of 100%, 50%, 25%, 12%, 6%, 3% and 1.5% are selected and displayed on LED7. When the button is pressed, the next channel is selected, starting from channel 0
es_es: ## Ejemplo: Prueba manual del Mux-8-1 Ocho señales con ciclos de trabajo del 100%, 50%, 25%, 12%, 6%, 3% y 1.5% se seleccionan y se muestran en el LED7. Cuando el botón se aprieta, el siguiente canal se selecciona, comenzando por el canal 0

source: **8-to-1 Mux**
es_es: **Mux-8-1**

source: ## Example: Manual testing of the 8-to-1 Mux Eight signals with duty cycles of 100%, 50%, 25%, 12%, 6%, 3% and 1.5% are selected and displayed on Green LED. The three switches select the input channel
es_es: ## Ejemplo: Prueba manual del Mux-8-1 Ocho señales con ciclos de trabajo del 100%, 50%, 25%, 12%, 6%, 3% y 1.5% se seleccionan y se muestran en el LED verde. Cuando el botón se aprieta, el siguiente canal se selecciona, comenzando por el canal 0

source: switches for selecting the channel
es_es: interruptor para seleccionar el canal

source: 4bits constant value: 1
es_es: Valor constante de 4 bits: 1

source: 4bits constant value: 2
es_es: Valor constante de 4 bits: 2

source: 4bits constant value: 4
es_es: Valor constante de 4 bits: 4

source: 4bits constant value: 8
es_es: Valor constante de 4 bits: 8

source: ## Example: Manual testing of the 4-bits 8-to-1 Mux The buttons selects which number is displayed on the LEDs: `0x1`,`0x2`,`0x4`,`0x8`,`0x9`,`0xA`,`0xC`, `0xF`
es_es: ## Ejemplo: Prueba manual del Mux-8-1 de 4 bits Los botones seleccionan qué número se muestra en los LEDS: `0x1`,`0x2`,`0x4`,`0x8`,`0x9`,`0xA`,`0xC`, `0xF`

source: **4-bits 8-to-1 Mux**
es_es: **Mux-8-1 de 4 bits**

source: ## Example: Manual testing of the 4-bits 8-to-1 Mux The switches select which number is displayed on the RGB LED: `0x1`,`0x2`,`0x4`,`0x8`,`0x9`,`0xA`,`0xC`, `0xF`
es_es: ## Ejemplo: Prueba manual del Mux-8-1 de 4 bits Los interruptores seleccionan qué número se muestra en el LED RGB: `0x1`,`0x2`,`0x4`,`0x8`,`0x9`,`0xA`,`0xC`, `0xF`

source: RGB LED
es_es: LED RGB

source: ## Example: Manual testing of the 1-to-2 DeMux The bit 1 is sent to either channel 0 or channel 1 depending on the button. When the button is pressed, the LED1 is ON. When the button is not pressed, the LED0 is on
es_es: ## Ejemplo: Prueba manual del DeMux-1-2 El bit 1 se envía bien al canal 0 ó al canal 1 dependiendo del botón. Cuando el botón se pulsa, el LED1 se activa. Cuando el botón no se aprieta, el LED0 se enciende

source: **1-to-2 DeMux**
es_es: **DeMux-1-2**

source: 3bits constant value: 0
es_es: Valor constante de 3 bits: 0

source: ## Example: Manual testing of the 1-to-2 DeMux The bit 1 is sent to either channel 0 or channel 1 depending on the switch. When it is ON, the RGB turns green. When it is OFF, the RGB LED turns red
es_es: ## Ejemplo: Prueba manual del DeMux-1-2 El bit 1 se envía bien al canal 0 ó al canal 1 dependiendo del interruptor. Cuando está activado, el LED RGB se pone verde. Cuando está desactivado, el LED RGB se pone rojo

source: Blue LED OFF
es_es: Led azul apagado

source: ## Example: Manual testing of the 4-bits 1-to-2 DeMux The 4-bits constant is sent to the 4 most significant LEDs or the 4 least significant LEDs
es_es: ## Ejemplo: Prueba manual del DeMux 1-2 de 4 bits La constante de 4-bits se saca por los 4 LEDS de mayor peso o por los 4 LEDs de menor peso

source: Display8-4: Display a 8-bits value on an 4-LEDs. The sel input selects the nibble to display
es_es: Display8-4: Mostrar un valor de 8-bits en 4 LEDs. La entrada sel selecciona el byte a mostrar

source: Counter-x01: 1-bit counter
es_es: Counter-x01: Contador de 1-bit

source: ## Example: Manual testing of the 4-bits 1-to-2 DeMux The 4-bits constant is sent to the channel 0 or 1, that in turn can be selected to turn the RGB LED
es_es: ## Ejemplo: Prueba manual del DeMux 1-2 de 4 bits La constante de 4-bits se saca por el canal 0 ó 1, que a su vez se puede seleccionar para poner el LED RGB verde

source: ## Example: Manual testing of the 1-to-4 DeMux The bit 1 is sent to output channels 0 - 3 depending on the counter. When the button is pressed, the counter is increased and the next LED is turned on
es_es: ## Ejemplo: Prueba manual del DeMux-1-4 El bit 1 se envía a los canales 0-3 dependiendo del contador. Cuando el botón se pulsa, el contador se incrementa y el siguiente LED se enciende

source: ## Example: Manual testing of the 1-to-4 DeMux The bit 1 is sent to output channels 0 - 3 depending on the switches. Each channel is connected to a different LED
es_es: ## Ejemplo: Prueba manual del DeMux-1-4 El bit 1 se envía a los canales 0-3 dependiendo de los interruptores. Cada canal se conecta a un LED diferente

source: 10-deMux-1-4-Bus-button-LEDs
es_es: 10-deMux-1-4-Bus-button-LEDsvv

source: ## Example: Manual testing of the 2-bits 1-to-4 DeMux The constant 0x3 is sent to output channels 0 - 3 depending on the counter. When the button is pressed, the counter is increased and the next LED is turned on
es_es: ## Ejemplo: Prueba manual del DeMux-1-4 de 2 bits La constante 0x3 se envía a los canales de salida 0-3 dependiendo del contador. Cuando el botón se aprieta, el contador se incrementa y el siguiente LED se enciende

source: **1-to-4 DeMux**
es_es: **DeMux-1-4**

source: Channel 2
es_es: Canal 2

source: Channel 3
es_es: Canal 3

source: 2bits constant value: 0
es_es: Valor constante de 2 bits: 0

source: External LEDs
es_es: LEDs externos

source: ## Example: Manual testing of the 1-to-8 DeMux The constant 1 is sent to output channels 0 - 7 depending on the counter. When the button is pressed, the counter is increased and the next LED is turned on
es_es: ## Ejemplo: Prueba manual del DeMux-1-8 La constante 1 se envía a los canales de salida 0-7 dependiendo del contador. Cuando el botón se aprieta, el contador se incrementa y el siguiente LED se enciende

source: **1-to-8 DeMux**
es_es: **DeMux-1-8**

source: Channel 4
es_es: Canal 4

source: Channel 5
es_es: Canal 5

source: Channel 6
es_es: Canal 6

source: Channel 7
es_es: Canal 7

source: ## Example: Manual testing of the 1-to-8 DeMux The constant 1 is sent to output channels 0 - 7 depending on the switches. The 8 output channels are grouped into a byte. The switch S1 determines which nibble is displayed on the LEDs
es_es: ## Ejemplo: Prueba manual del DeMux-1-8 La constante 1 se envía a los canales de salida 0-7 dependiendo de los interruptores. Los 8 canales se salida se agrupan en un byte. El interruptor S1 determina qué nibble se muestra en los LEDs

source: Display16-8: Display a 16-bits value on an 8-LEDs. The sel input selects the byte to display
es_es: Display16-8: Mostrar un valor de 16-bits en 8 LEDs. La entrada sel selecciona el byte a mostrar

source: 2-to-1 Multplexer (8-bit channels)
es_es: Multiplexor 2-1 (canales de 8 bits)

source: ## Example: Manual testing of the 2-bits 1-to-8 DeMux The constant 0x3 is sent to output channels 0 - 7 depending on the counter. When the button is pressed, the counter is increased and the next LED is turned on
es_es: ## Ejemplo: Prueba manual del DeMux-1-8 de 2 bits La constante 0x3 se envía a los canales de salida 0-7 dependiendo del contador. Cuando el botón se aprieta, el contador se incrementa y el siguiente LED se enciende

source: Display16-4: Display a 16-bits value on an 4-LEDs. The sel input selects the byte to display
es_es: Display16-4: Mostrar un valor de 16-bits en 4 LEDs. La entrada sel selecciona el byte a mostrar

source: ## Example: Manual testing of the 2-bits 1-to-8 DeMux The constant 0x3 is sent to output channels 0 - 7 depending on the switches. The external button selects which 4-bits group is displayed on the RGB LED
es_es: ## Ejemplo: Prueba manual del DeMux-1-8 de 2 bits La constante 0x3 se envía a los canales de salida 0-7 dependiendo de los interruptores. El botón externo selecciona qué grupo de 4 bits se muestra en el LED RGB

source: External button
es_es: Botón externo

source: Bus12-Join-one-fourth: Join the four buses into an 12-bits Bus
es_es: Bus10-Join-one-fourth: Juntar los cuatro buses en uno de 12 bits

source: UINT16-12bits: Extend a 12-bits unsigned integer to 16-bits
es_es: UINT16-12bits: Extender un entero sin signo de 12 a 16 bits

source: Bus16-Join-4-12: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-4-12: Juntar los dos buses en uno de 16 bits

source: Bus24-Join-half: Join the two buses into an 24-bits Bus
es_es: Bus24-Join-half: Juntar los dos buses en uno de 24 bits

source: Display24-8: Display a 24-bits value on 8-LEDs. The sel input selects the byte to display
es_es: Display24-8: Mostrar un valor de 24-bits en 8 LEDs. La entrada sel selecciona el byte a mostrar

source: Counter-M-x02: 2-bits M module counter
es_es: Counter-M-x02: Contador módulo M de 2 bits

source: Comp2-2bit: Comparator of two 2-bit numbers
es_es: Comp2-2-bit: Comparador de dos números de 2 bits

source: Comp2-1bit: Comparator of two 1-bit numbers
es_es: Comp2-1-bit: Comparador de dos números de 1 bit

source: reg-rst-2-bits: 2-bits register with reset
es_es: reg-rst-2-bits: Registro de 2 bits con reset

source: 1-bit-Reg-rst: 1-Bit register with reset
es_es: 1-bit-Reg-rst: Registro de 1-bit con reset

source: 8bits constant value: 0
es_es: Valor constante de 8 bits: 0

source: Generic: 8-bits generic constant (0-255)
es_es: Generic: Constante genérica de 8-bits (0-255)

source: 2-bits Comparator
es_es: Comparador de 2-bits

source: Maximum count reached
es_es: Cuenta máxima alcanzada

source: 2-bits register
es_es: Registro de 2 bits

source: If the max count is reached and the cnt tic is received, the register is reset to 0
es_es: Si se alcanza la cuenta máxima y se recibe un tic en cnt, el registro se inicializa a 0
